grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#pragma once 

/* --- FMC: FMC ----------------------------------------------------- */

/** @defgroup fmc_registers FMC Register
@{*/

/** FMC_FMC_BCR1 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories. **/
#define FMC_FMC_BCR1			MMIO32(FMC_BASE + 0x00)
/** FMC_FMC_BTR1 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers). **/
#define FMC_FMC_BTR1			MMIO32(FMC_BASE + 0x04)
/** FMC_FMC_BCR2 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories. **/
#define FMC_FMC_BCR2			MMIO32(FMC_BASE + 0x08)
/** FMC_FMC_BTR2 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers). **/
#define FMC_FMC_BTR2			MMIO32(FMC_BASE + 0x0c)
/** FMC_FMC_BCR3 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories. **/
#define FMC_FMC_BCR3			MMIO32(FMC_BASE + 0x10)
/** FMC_FMC_BTR3 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers). **/
#define FMC_FMC_BTR3			MMIO32(FMC_BASE + 0x14)
/** FMC_FMC_BCR4 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories. **/
#define FMC_FMC_BCR4			MMIO32(FMC_BASE + 0x18)
/** FMC_FMC_BTR4 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers). **/
#define FMC_FMC_BTR4			MMIO32(FMC_BASE + 0x1c)
/** FMC_FMC_PCR NAND Flash control registers **/
#define FMC_FMC_PCR			MMIO32(FMC_BASE + 0x80)
/** FMC_FMC_SR This register contains information about the FIFO status and interrupt. The FMC features a FIFO that is used when writing to memories to transfer up to 16 words of data.This is used to quickly write to the FIFO and free the AXI bus for transactions to peripherals other than the FMC, while the FMC is draining its FIFO into the memory. One of these register bits indicates the status of the FIFO, for ECC purposes.The ECC is calculated while the data are written to the memory. To read the correct ECC, the software must consequently wait until the FIFO is empty. **/
#define FMC_FMC_SR			MMIO32(FMC_BASE + 0x84)
/** FMC_FMC_PMEM The FMC_PMEM read/write register contains the timing information for NAND Flash memory bank. This information is used to access either the common memory space of the NAND Flash for command, address write access and data read/write access. **/
#define FMC_FMC_PMEM			MMIO32(FMC_BASE + 0x88)
/** FMC_FMC_PATT The FMC_PATT read/write register contains the timing information for NAND Flash memory bank. It is used for 8-bit accesses to the attribute memory space of the NAND Flash for the last address write access if the timing must differ from that of previous accesses (for Ready/Busy management, refer to Section20.8.5: NAND Flash prewait feature). **/
#define FMC_FMC_PATT			MMIO32(FMC_BASE + 0x8c)
/** FMC_FMC_ECCR This register contain the current error correction code value computed by the ECC computation modules of the FMC NAND controller. When the CPU reads/writes the data from a NAND Flash memory page at the correct address (refer to Section20.8.6: Computation of the error correction code (ECC) in NAND Flash memory), the data read/written from/to the NAND Flash memory are processed automatically by the ECC computation module. When X bytes have been read (according to the ECCPS field in the FMC_PCR registers), the CPU must read the computed ECC value from the FMC_ECC registers. It then verifies if these computed parity data are the same as the parity value recorded in the spare area, to determine whether a page is valid, and, to correct it otherwise. The FMC_ECCR register should be cleared after being read by setting the ECCEN bit to 0. To compute a new data block, the ECCEN bit must be set to 1. **/
#define FMC_FMC_ECCR			MMIO32(FMC_BASE + 0x94)
/** FMC_FMC_BWTR1 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access. **/
#define FMC_FMC_BWTR1			MMIO32(FMC_BASE + 0x104)
/** FMC_FMC_BWTR2 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access. **/
#define FMC_FMC_BWTR2			MMIO32(FMC_BASE + 0x10c)
/** FMC_FMC_BWTR3 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access. **/
#define FMC_FMC_BWTR3			MMIO32(FMC_BASE + 0x114)
/** FMC_FMC_BWTR4 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access. **/
#define FMC_FMC_BWTR4			MMIO32(FMC_BASE + 0x11c)
/** FMC_FMC_SDCR1 This register contains the control parameters for each SDRAM memory bank **/
#define FMC_FMC_SDCR1			MMIO32(FMC_BASE + 0x140)
/** FMC_FMC_SDCR2 This register contains the control parameters for each SDRAM memory bank **/
#define FMC_FMC_SDCR2			MMIO32(FMC_BASE + 0x144)
/** FMC_FMC_SDTR1 This register contains the timing parameters of each SDRAM bank **/
#define FMC_FMC_SDTR1			MMIO32(FMC_BASE + 0x148)
/** FMC_FMC_SDTR2 This register contains the timing parameters of each SDRAM bank **/
#define FMC_FMC_SDTR2			MMIO32(FMC_BASE + 0x14c)
/** FMC_FMC_SDCMR This register contains the command issued when the SDRAM device is accessed. This register is used to initialize the SDRAM device, and to activate the Self-refresh and the Power-down modes. As soon as the MODE field is written, the command will be issued only to one or to both SDRAM banks according to CTB1 and CTB2 command bits. This register is the same for both SDRAM banks. **/
#define FMC_FMC_SDCMR			MMIO32(FMC_BASE + 0x150)
/** FMC_FMC_SDRTR This register sets the refresh rate in number of SDCLK clock cycles between the refresh cycles by configuring the Refresh Timer Count value.Examplewhere 64 ms is the SDRAM refresh period.The refresh rate must be increased by 20 SDRAM clock cycles (as in the above example) to obtain a safe margin if an internal refresh request occurs when a read request has been accepted. It corresponds to a COUNT value of 0000111000000 (448). This 13-bit field is loaded into a timer which is decremented using the SDRAM clock. This timer generates a refresh pulse when zero is reached. The COUNT value must be set at least to 41 SDRAM clock cycles.As soon as the FMC_SDRTR register is programmed, the timer starts counting. If the value programmed in the register is 0, no refresh is carried out. This register must not be reprogrammed after the initialization procedure to avoid modifying the refresh rate.Each time a refresh pulse is generated, this 13-bit COUNT field is reloaded into the counter.If a memory access is in progress, the Auto-refresh request is delayed. However, if the memory access and Auto-refresh requests are generated simultaneously, the Auto-refresh takes precedence. If the memory access occurs during a refresh operation, the request is buffered to be processed when the refresh is complete.This register is common to SDRAM bank 1 and bank 2. **/
#define FMC_FMC_SDRTR			MMIO32(FMC_BASE + 0x154)
/** FMC_FMC_SDSR SDRAM Status register **/
#define FMC_FMC_SDSR			MMIO32(FMC_BASE + 0x158)

/**@}*/


/** @defgroup fmc_fmc_bcr1 FMCBCR1 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.
@{*/

/** FMC_FMC_BCR1_FMCEN FMC controller Enable This bit enables/disables the FMC controller. Note: The FMCEN bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register. **/
#define FMC_FMC_BCR1_FMCEN		(1 << 31)

#define FMC_FMC_BCR1_BMAP_SHIFT		24
#define FMC_FMC_BCR1_BMAP_MASK		0x03
/** @defgroup fmc_fmc_bcr1_bmap BMAP FMC bank mapping These bits allows different to remap SDRAM bank2 or swap the FMC NOR/PSRAM and SDRAM banks.Refer to Table 10 for Note: The BMAP bits of the FMC_BCR2..4 registers are dont care. It is only enabled through the FMC_BCR1 register.
@{*/
/**@}*/

