grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_BTR3_ADDSET_SHIFT		0
#define FMC_FMC_BTR3_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_btr3_addset ADDSET Address setup phase duration These bits are written by software to define the duration of the address setup phase (refer to Figure81 to Figure93), used in SRAMs, ROMs and asynchronous NOR Flash: For each access mode address setup phase duration, please refer to the respective figure (refer to Figure81 to Figure93). Note: In synchronous accesses, this value is dont care. In Muxed mode or Mode D, the minimum value for ADDSET is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_bcr4 FMCBCR4 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.
@{*/

/** FMC_FMC_BCR4_FMCEN FMC controller Enable This bit enables/disables the FMC controller. Note: The FMCEN bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register. **/
#define FMC_FMC_BCR4_FMCEN		(1 << 31)

#define FMC_FMC_BCR4_BMAP_SHIFT		24
#define FMC_FMC_BCR4_BMAP_MASK		0x03
/** @defgroup fmc_fmc_bcr4_bmap BMAP FMC bank mapping These bits allows different to remap SDRAM bank2 or swap the FMC NOR/PSRAM and SDRAM banks.Refer to Table 10 for Note: The BMAP bits of the FMC_BCR2..4 registers are dont care. It is only enabled through the FMC_BCR1 register.
@{*/
/**@}*/

/** FMC_FMC_BCR4_WFDIS Write FIFO Disable This bit disables the Write FIFO used by the FMC controller. Note: The WFDIS bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register. **/
#define FMC_FMC_BCR4_WFDIS		(1 << 21)
/** FMC_FMC_BCR4_CCLKEN Continuous Clock Enable This bit enables the FMC_CLK clock output to external memory devices. Note: The CCLKEN bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register. Bank 1 must be configured in synchronous mode to generate the FMC_CLK continuous clock. If CCLKEN bit is set, the FMC_CLK clock ratio is specified by CLKDIV value in the FMC_BTR1 register. CLKDIV in FMC_BWTR1 is dont care. If the synchronous mode is used and CCLKEN bit is set, the synchronous memories connected to other banks than Bank 1 are clocked by the same clock (the CLKDIV value in the FMC_BTR2..4 and FMC_BWTR2..4 registers for other banks has no effect.) **/
#define FMC_FMC_BCR4_CCLKEN		(1 << 20)
/** FMC_FMC_BCR4_CBURSTRW Write burst enable For PSRAM (CRAM) operating in Burst mode, the bit enables synchronous accesses during write operations. The enable bit for synchronous read accesses is the BURSTEN bit in the FMC_BCRx register. **/
#define FMC_FMC_BCR4_CBURSTRW		(1 << 19)

#define FMC_FMC_BCR4_CPSIZE_SHIFT		16
#define FMC_FMC_BCR4_CPSIZE_MASK		0x07
/** @defgroup fmc_fmc_bcr4_cpsize CPSIZE CRAM Page Size These are used for Cellular RAM 1.5 which does not allow burst access to cross the address boundaries between pages. When these bits are configured, the FMC controller splits automatically the burst access when the memory page size is reached (refer to memory datasheet for page size). Other configuration: reserved.
@{*/
/**@}*/

/** FMC_FMC_BCR4_ASYNCWAIT Wait signal during asynchronous transfers This bit enables/disables the FMC to use the wait signal even during an asynchronous protocol. **/
#define FMC_FMC_BCR4_ASYNCWAIT		(1 << 15)
/** FMC_FMC_BCR4_EXTMOD Extended mode enable. This bit enables the FMC to program the write timings for asynchronous accesses inside the FMC_BWTR register, thus resulting in different timings for read and write operations. Note: When the extended mode is disabled, the FMC can operate in Mode1 or Mode2 as follows: ** Mode 1 is the default mode when the SRAM/PSRAM memory type is selected (MTYP =0x0 or 0x01) ** Mode 2 is the default mode when the NOR memory type is selected (MTYP = 0x10). **/
#define FMC_FMC_BCR4_EXTMOD		(1 << 14)
/** FMC_FMC_BCR4_WAITEN Wait enable bit This bit enables/disables wait-state insertion via the NWAIT signal when accessing the memory in synchronous mode. **/
#define FMC_FMC_BCR4_WAITEN		(1 << 13)
/** FMC_FMC_BCR4_WREN Write enable bit This bit indicates whether write operations are enabled/disabled in the bank by the FMC: **/
#define FMC_FMC_BCR4_WREN		(1 << 12)
/** FMC_FMC_BCR4_WAITCFG Wait timing configuration The NWAIT signal indicates whether the data from the memory are valid or if a wait state must be inserted when accessing the memory in synchronous mode. This configuration bit determines if NWAIT is asserted by the memory one clock cycle before the wait state or during the wait state: **/
#define FMC_FMC_BCR4_WAITCFG		(1 << 11)
/** FMC_FMC_BCR4_WAITPOL Wait signal polarity bit This bit defines the polarity of the wait signal from memory used for either in synchronous or asynchronous mode: **/
#define FMC_FMC_BCR4_WAITPOL		(1 << 9)
/** FMC_FMC_BCR4_BURSTEN Burst enable bit This bit enables/disables synchronous accesses during read operations. It is valid only for synchronous memories operating in Burst mode: **/
#define FMC_FMC_BCR4_BURSTEN		(1 << 8)
/** FMC_FMC_BCR4_FACCEN Flash access enable This bit enables NOR Flash memory access operations. **/
#define FMC_FMC_BCR4_FACCEN		(1 << 6)

#define FMC_FMC_BCR4_MWID_SHIFT		4
#define FMC_FMC_BCR4_MWID_MASK		0x03
/** @defgroup fmc_fmc_bcr4_mwid MWID Memory data bus width Defines the external memory device width, valid for all type of memories.
@{*/
/**@}*/


#define FMC_FMC_BCR4_MTYP_SHIFT		2
#define FMC_FMC_BCR4_MTYP_MASK		0x03
/** @defgroup fmc_fmc_bcr4_mtyp MTYP Memory type These bits define the type of external memory attached to the corresponding memory bank:
@{*/
/**@}*/

/** FMC_FMC_BCR4_MUXEN Address/data multiplexing enable bit When this bit is set, the address and data values are multiplexed on the data bus, valid only with NOR and PSRAM memories: **/
#define FMC_FMC_BCR4_MUXEN		(1 << 1)
/** FMC_FMC_BCR4_MBKEN Memory bank enable bit This bit enables the memory bank. After reset Bank1 is enabled, all others are disabled. Accessing a disabled bank causes an ERROR on AXI bus. **/
#define FMC_FMC_BCR4_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fmc_fmc_btr4 FMCBTR4 This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers).
@{*/


#define FMC_FMC_BTR4_ACCMOD_SHIFT		28
#define FMC_FMC_BTR4_ACCMOD_MASK		0x03
/** @defgroup fmc_fmc_btr4_accmod ACCMOD Access mode These bits specify the asynchronous access modes as shown in the timing diagrams. They are taken into account only when the EXTMOD bit in the FMC_BCRx register is 1.
@{*/
/**@}*/


#define FMC_FMC_BTR4_DATLAT_SHIFT		24
#define FMC_FMC_BTR4_DATLAT_MASK		0x0f
/** @defgroup fmc_fmc_btr4_datlat DATLAT Data latency for synchronous memory For synchronous access with read write burst mode enabled these bits define the number of memory clock cycles
@{*/
/**@}*/


#define FMC_FMC_BTR4_CLKDIV_SHIFT		20
#define FMC_FMC_BTR4_CLKDIV_MASK		0x0f
/** @defgroup fmc_fmc_btr4_clkdiv CLKDIV Clock divide ratio (for FMC_CLK signal) These bits define the period of FMC_CLK clock output signal, expressed in number of KCK_FMC cycles: In asynchronous NOR Flash, SRAM or PSRAM accesses, this value is dont care. Note: Refer to Section20.6.5: Synchronous transactions for FMC_CLK divider ratio formula)
@{*/
/**@}*/


