grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_BTR4_BUSTURN_SHIFT		16
#define FMC_FMC_BTR4_BUSTURN_MASK		0x0f
/** @defgroup fmc_fmc_btr4_busturn BUSTURN Bus turnaround phase duration These bits are written by software to add a delay at the end of a write-to-read or read-to write transaction. The programmed bus turnaround delay is inserted between an asynchronous read (in muxed or mode D) or write transaction and any other asynchronous /synchronous read/write from/to a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except in muxed mode and mode D. There is a bus turnaround delay of 1 FMC clock cycle between: Two consecutive asynchronous read transfers to the same static memory bank except for modes muxed and D. An asynchronous read to an asynchronous or synchronous write to any static bank or dynamic bank except in modes muxed and D mode. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank. A synchronous write (burst or single) access and an asynchronous write or read transfer to or from static memory bank (the bank can be the same or a different one in case of a read operation. Two consecutive synchronous read operations (in Burst or Single mode) followed by any synchronous/asynchronous read or write from/to another static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write access (in Burst or Single mode) and a synchronous read from the same or a different bank. The bus turnaround delay allows to match the minimum time between consecutive transactions (tEHEL from NEx high to NEx low) and the maximum time required by the memory to free the data bus after a read access (tEHQZ): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin and (BUSTRUN + 2)KCK_FMC period &#8805; tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period &#8805; max (tEHELmin, tEHQZmax) if EXTMOD =1. ...
@{*/
/**@}*/


#define FMC_FMC_BTR4_DATAST_SHIFT		8
#define FMC_FMC_BTR4_DATAST_MASK		0xff
/** @defgroup fmc_fmc_btr4_datast DATAST Data-phase duration These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous accesses: For each memory type and access mode data-phase duration, please refer to the respective figure (Figure81 to Figure93). Example: Mode1, write access, DATAST=1: Data-phase duration= DATAST+1 = 2 KCK_FMC clock cycles. Note: In synchronous accesses, this value is dont care.
@{*/
/**@}*/


#define FMC_FMC_BTR4_ADDHLD_SHIFT		4
#define FMC_FMC_BTR4_ADDHLD_MASK		0x0f
/** @defgroup fmc_fmc_btr4_addhld ADDHLD Address-hold phase duration These bits are written by software to define the duration of the address hold phase (refer to Figure81 to Figure93), used in mode D or multiplexed accesses: For each access mode address-hold phase duration, please refer to the respective figure (Figure81 to Figure93). Note: In synchronous accesses, this value is not used, the address hold phase is always 1 memory clock period duration.
@{*/
/**@}*/


#define FMC_FMC_BTR4_ADDSET_SHIFT		0
#define FMC_FMC_BTR4_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_btr4_addset ADDSET Address setup phase duration These bits are written by software to define the duration of the address setup phase (refer to Figure81 to Figure93), used in SRAMs, ROMs and asynchronous NOR Flash: For each access mode address setup phase duration, please refer to the respective figure (refer to Figure81 to Figure93). Note: In synchronous accesses, this value is dont care. In Muxed mode or Mode D, the minimum value for ADDSET is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_pcr FMCPCR NAND Flash control registers
@{*/


#define FMC_FMC_PCR_ECCPS_SHIFT		17
#define FMC_FMC_PCR_ECCPS_MASK		0x07
/** @defgroup fmc_fmc_pcr_eccps ECCPS ECC page size. These bits define the page size for the extended ECC:
@{*/
/**@}*/


#define FMC_FMC_PCR_TAR_SHIFT		13
#define FMC_FMC_PCR_TAR_MASK		0x0f
/** @defgroup fmc_fmc_pcr_tar TAR ALE to RE delay. These bits set time from ALE low to RE low in number of KCK_FMC clock cycles. Time is: t_ar = (TAR + SET + 2) TKCK_FMC where TKCK_FMC is the FMC clock period Note: Set is MEMSET or ATTSET according to the addressed space.
@{*/
/**@}*/


#define FMC_FMC_PCR_TCLR_SHIFT		9
#define FMC_FMC_PCR_TCLR_MASK		0x0f
/** @defgroup fmc_fmc_pcr_tclr TCLR CLE to RE delay. These bits set time from CLE low to RE low in number of KCK_FMC clock cycles. The time is give by the following formula: t_clr = (TCLR + SET + 2) TKCK_FMC where TKCK_FMC is the KCK_FMC clock period Note: Set is MEMSET or ATTSET according to the addressed space.
@{*/
/**@}*/

/** FMC_FMC_PCR_ECCEN ECC computation logic enable bit **/
#define FMC_FMC_PCR_ECCEN		(1 << 6)

#define FMC_FMC_PCR_PWID_SHIFT		4
#define FMC_FMC_PCR_PWID_MASK		0x03
/** @defgroup fmc_fmc_pcr_pwid PWID Data bus width. These bits define the external memory device width.
@{*/
/**@}*/

/** FMC_FMC_PCR_PBKEN NAND Flash memory bank enable bit. This bit enables the memory bank. Accessing a disabled memory bank causes an ERROR on AXI bus **/
#define FMC_FMC_PCR_PBKEN		(1 << 2)
/** FMC_FMC_PCR_PWAITEN Wait feature enable bit. This bit enables the Wait feature for the NAND Flash memory bank: **/
#define FMC_FMC_PCR_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fmc_fmc_sr FMCSR This register contains information about the FIFO status and interrupt. The FMC features a FIFO that is used when writing to memories to transfer up to 16 words of data.This is used to quickly write to the FIFO and free the AXI bus for transactions to peripherals other than the FMC, while the FMC is draining its FIFO into the memory. One of these register bits indicates the status of the FIFO, for ECC purposes.The ECC is calculated while the data are written to the memory. To read the correct ECC, the software must consequently wait until the FIFO is empty.
@{*/

/** FMC_FMC_SR_FEMPT FIFO empty. Read-only bit that provides the status of the FIFO **/
#define FMC_FMC_SR_FEMPT		(1 << 6)
/** FMC_FMC_SR_IFEN Interrupt falling edge detection enable bit **/
#define FMC_FMC_SR_IFEN		(1 << 5)
/** FMC_FMC_SR_ILEN Interrupt high-level detection enable bit **/
#define FMC_FMC_SR_ILEN		(1 << 4)
/** FMC_FMC_SR_IREN Interrupt rising edge detection enable bit **/
#define FMC_FMC_SR_IREN		(1 << 3)
/** FMC_FMC_SR_IFS Interrupt falling edge status The flag is set by hardware and reset by software. Note: If this bit is written by software to 1 it will be set. **/
#define FMC_FMC_SR_IFS		(1 << 2)
/** FMC_FMC_SR_ILS Interrupt high-level status The flag is set by hardware and reset by software. **/
#define FMC_FMC_SR_ILS		(1 << 1)
/** FMC_FMC_SR_IRS Interrupt rising edge status The flag is set by hardware and reset by software. Note: If this bit is written by software to 1 it will be set. **/
#define FMC_FMC_SR_IRS		(1 << 0)

/**@}*/

/** @defgroup fmc_fmc_pmem FMCPMEM The FMC_PMEM read/write register contains the timing information for NAND Flash memory bank. This information is used to access either the common memory space of the NAND Flash for command, address write access and data read/write access.
@{*/


