grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_PMEM_MEMHIZ_SHIFT		24
#define FMC_FMC_PMEM_MEMHIZ_MASK		0xff
/** @defgroup fmc_fmc_pmem_memhiz MEMHIZ Common memory x data bus Hi-Z time These bits define the number of KCK_FMC clock cycles during which the data bus is kept Hi-Z after the start of a NAND Flash write access to common memory space. This is only valid for write transactions:
@{*/
/**@}*/


#define FMC_FMC_PMEM_MEMHOLD_SHIFT		16
#define FMC_FMC_PMEM_MEMHOLD_MASK		0xff
/** @defgroup fmc_fmc_pmem_memhold MEMHOLD Common memory hold time These bits define the number of KCK_FMC clock cycles for write accesses and KCK_FMC+1 clock cycles for read accesses during which the address is held (and data for write accesses) after the command is de-asserted (NWE, NOE), for NAND Flash read or write access to common memory space:
@{*/
/**@}*/


#define FMC_FMC_PMEM_MEMWAIT_SHIFT		8
#define FMC_FMC_PMEM_MEMWAIT_MASK		0xff
/** @defgroup fmc_fmc_pmem_memwait MEMWAIT Common memory wait time These bits define the minimum number of KCK_FMC (+1) clock cycles to assert the command (NWE, NOE), for NAND Flash read or write access to common memory space. The duration of command assertion is extended if the wait signal (NWAIT) is active (low) at the end of the programmed value of KCK_FMC:
@{*/
/**@}*/


#define FMC_FMC_PMEM_MEMSET_SHIFT		0
#define FMC_FMC_PMEM_MEMSET_MASK		0xff
/** @defgroup fmc_fmc_pmem_memset MEMSET Common memory x setup time These bits define the number of KCK_FMC (+1) clock cycles to set up the address before the command assertion (NWE, NOE), for NAND Flash read or write access to common memory space:
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_patt FMCPATT The FMC_PATT read/write register contains the timing information for NAND Flash memory bank. It is used for 8-bit accesses to the attribute memory space of the NAND Flash for the last address write access if the timing must differ from that of previous accesses (for Ready/Busy management, refer to Section20.8.5: NAND Flash prewait feature).
@{*/


#define FMC_FMC_PATT_ATTHIZ_SHIFT		24
#define FMC_FMC_PATT_ATTHIZ_MASK		0xff
/** @defgroup fmc_fmc_patt_atthiz ATTHIZ Attribute memory data bus Hi-Z time These bits define the number of KCK_FMC clock cycles during which the data bus is kept in Hi-Z after the start of a NAND Flash write access to attribute memory space on socket. Only valid for writ transaction:
@{*/
/**@}*/


#define FMC_FMC_PATT_ATTHOLD_SHIFT		16
#define FMC_FMC_PATT_ATTHOLD_MASK		0xff
/** @defgroup fmc_fmc_patt_atthold ATTHOLD Attribute memory hold time These bits define the number of KCK_FMC clock cycles during which the address is held (and data for write access) after the command de-assertion (NWE, NOE), for NAND Flash read or write access to attribute memory space:
@{*/
/**@}*/


#define FMC_FMC_PATT_ATTWAIT_SHIFT		8
#define FMC_FMC_PATT_ATTWAIT_MASK		0xff
/** @defgroup fmc_fmc_patt_attwait ATTWAIT Attribute memory wait time These bits define the minimum number of x KCK_FMC (+1) clock cycles to assert the command (NWE, NOE), for NAND Flash read or write access to attribute memory space. The duration for command assertion is extended if the wait signal (NWAIT) is active (low) at the end of the programmed value of KCK_FMC:
@{*/
/**@}*/


#define FMC_FMC_PATT_ATTSET_SHIFT		0
#define FMC_FMC_PATT_ATTSET_MASK		0xff
/** @defgroup fmc_fmc_patt_attset ATTSET Attribute memory setup time These bits define the number of KCK_FMC (+1) clock cycles to set up address before the command assertion (NWE, NOE), for NAND Flash read or write access to attribute memory space:
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_eccr FMCECCR This register contain the current error correction code value computed by the ECC computation modules of the FMC NAND controller. When the CPU reads/writes the data from a NAND Flash memory page at the correct address (refer to Section20.8.6: Computation of the error correction code (ECC) in NAND Flash memory), the data read/written from/to the NAND Flash memory are processed automatically by the ECC computation module. When X bytes have been read (according to the ECCPS field in the FMC_PCR registers), the CPU must read the computed ECC value from the FMC_ECC registers. It then verifies if these computed parity data are the same as the parity value recorded in the spare area, to determine whether a page is valid, and, to correct it otherwise. The FMC_ECCR register should be cleared after being read by setting the ECCEN bit to 0. To compute a new data block, the ECCEN bit must be set to 1.
@{*/


#define FMC_FMC_ECCR_ECC_SHIFT		0
#define FMC_FMC_ECCR_ECC_MASK		0xffffffff
/** @defgroup fmc_fmc_eccr_ecc ECC ECC result This field contains the value computed by the ECC computation logic. Table167 describes the contents of these bit fields.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_bwtr1 FMCBWTR1 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access.
@{*/


#define FMC_FMC_BWTR1_ACCMOD_SHIFT		28
#define FMC_FMC_BWTR1_ACCMOD_MASK		0x03
/** @defgroup fmc_fmc_bwtr1_accmod ACCMOD Access mode. These bits specify the asynchronous access modes as shown in the next timing diagrams.These bits are taken into account only when the EXTMOD bit in the FMC_BCRx register is 1.
@{*/
/**@}*/


#define FMC_FMC_BWTR1_BUSTURN_SHIFT		16
#define FMC_FMC_BWTR1_BUSTURN_MASK		0x0f
/** @defgroup fmc_fmc_bwtr1_busturn BUSTURN Bus turnaround phase duration These bits are written by software to add a delay at the end of a write transaction to match the minimum time between consecutive transactions (tEHEL from ENx high to ENx low): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin. The programmed bus turnaround delay is inserted between a an asynchronous write transfer and any other asynchronous /synchronous read or write transfer to or from a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except for muxed mode and mode D. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank A synchronous write transfer ((in Burst or Single mode) and an asynchronous write or read transfer to or from static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write transfer (in Burst or Single mode) and a synchronous read from the same or a different bank. ...
@{*/
/**@}*/


#define FMC_FMC_BWTR1_DATAST_SHIFT		8
#define FMC_FMC_BWTR1_DATAST_MASK		0xff
/** @defgroup fmc_fmc_bwtr1_datast DATAST Data-phase duration. These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous SRAM, PSRAM and NOR Flash memory accesses:
@{*/
/**@}*/


