grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_BWTR1_ADDHLD_SHIFT		4
#define FMC_FMC_BWTR1_ADDHLD_MASK		0x0f
/** @defgroup fmc_fmc_bwtr1_addhld ADDHLD Address-hold phase duration. These bits are written by software to define the duration of the address hold phase (refer to Figure81 to Figure93), used in asynchronous multiplexed accesses: ... Note: In synchronous NOR Flash accesses, this value is not used, the address hold phase is always 1 Flash clock period duration.
@{*/
/**@}*/


#define FMC_FMC_BWTR1_ADDSET_SHIFT		0
#define FMC_FMC_BWTR1_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_bwtr1_addset ADDSET Address setup phase duration. These bits are written by software to define the duration of the address setup phase in KCK_FMC cycles (refer to Figure81 to Figure93), used in asynchronous accesses: ... Note: In synchronous accesses, this value is not used, the address setup phase is always 1 Flash clock period duration. In muxed mode, the minimum ADDSET value is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_bwtr2 FMCBWTR2 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access.
@{*/


#define FMC_FMC_BWTR2_ACCMOD_SHIFT		28
#define FMC_FMC_BWTR2_ACCMOD_MASK		0x03
/** @defgroup fmc_fmc_bwtr2_accmod ACCMOD Access mode. These bits specify the asynchronous access modes as shown in the next timing diagrams.These bits are taken into account only when the EXTMOD bit in the FMC_BCRx register is 1.
@{*/
/**@}*/


#define FMC_FMC_BWTR2_BUSTURN_SHIFT		16
#define FMC_FMC_BWTR2_BUSTURN_MASK		0x0f
/** @defgroup fmc_fmc_bwtr2_busturn BUSTURN Bus turnaround phase duration These bits are written by software to add a delay at the end of a write transaction to match the minimum time between consecutive transactions (tEHEL from ENx high to ENx low): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin. The programmed bus turnaround delay is inserted between a an asynchronous write transfer and any other asynchronous /synchronous read or write transfer to or from a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except for muxed mode and mode D. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank A synchronous write transfer ((in Burst or Single mode) and an asynchronous write or read transfer to or from static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write transfer (in Burst or Single mode) and a synchronous read from the same or a different bank. ...
@{*/
/**@}*/


#define FMC_FMC_BWTR2_DATAST_SHIFT		8
#define FMC_FMC_BWTR2_DATAST_MASK		0xff
/** @defgroup fmc_fmc_bwtr2_datast DATAST Data-phase duration. These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous SRAM, PSRAM and NOR Flash memory accesses:
@{*/
/**@}*/


#define FMC_FMC_BWTR2_ADDHLD_SHIFT		4
#define FMC_FMC_BWTR2_ADDHLD_MASK		0x0f
/** @defgroup fmc_fmc_bwtr2_addhld ADDHLD Address-hold phase duration. These bits are written by software to define the duration of the address hold phase (refer to Figure81 to Figure93), used in asynchronous multiplexed accesses: ... Note: In synchronous NOR Flash accesses, this value is not used, the address hold phase is always 1 Flash clock period duration.
@{*/
/**@}*/


#define FMC_FMC_BWTR2_ADDSET_SHIFT		0
#define FMC_FMC_BWTR2_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_bwtr2_addset ADDSET Address setup phase duration. These bits are written by software to define the duration of the address setup phase in KCK_FMC cycles (refer to Figure81 to Figure93), used in asynchronous accesses: ... Note: In synchronous accesses, this value is not used, the address setup phase is always 1 Flash clock period duration. In muxed mode, the minimum ADDSET value is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_bwtr3 FMCBWTR3 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access.
@{*/


#define FMC_FMC_BWTR3_ACCMOD_SHIFT		28
#define FMC_FMC_BWTR3_ACCMOD_MASK		0x03
/** @defgroup fmc_fmc_bwtr3_accmod ACCMOD Access mode. These bits specify the asynchronous access modes as shown in the next timing diagrams.These bits are taken into account only when the EXTMOD bit in the FMC_BCRx register is 1.
@{*/
/**@}*/


#define FMC_FMC_BWTR3_BUSTURN_SHIFT		16
#define FMC_FMC_BWTR3_BUSTURN_MASK		0x0f
/** @defgroup fmc_fmc_bwtr3_busturn BUSTURN Bus turnaround phase duration These bits are written by software to add a delay at the end of a write transaction to match the minimum time between consecutive transactions (tEHEL from ENx high to ENx low): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin. The programmed bus turnaround delay is inserted between a an asynchronous write transfer and any other asynchronous /synchronous read or write transfer to or from a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except for muxed mode and mode D. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank A synchronous write transfer ((in Burst or Single mode) and an asynchronous write or read transfer to or from static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write transfer (in Burst or Single mode) and a synchronous read from the same or a different bank. ...
@{*/
/**@}*/


