grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_BWTR3_DATAST_SHIFT		8
#define FMC_FMC_BWTR3_DATAST_MASK		0xff
/** @defgroup fmc_fmc_bwtr3_datast DATAST Data-phase duration. These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous SRAM, PSRAM and NOR Flash memory accesses:
@{*/
/**@}*/


#define FMC_FMC_BWTR3_ADDHLD_SHIFT		4
#define FMC_FMC_BWTR3_ADDHLD_MASK		0x0f
/** @defgroup fmc_fmc_bwtr3_addhld ADDHLD Address-hold phase duration. These bits are written by software to define the duration of the address hold phase (refer to Figure81 to Figure93), used in asynchronous multiplexed accesses: ... Note: In synchronous NOR Flash accesses, this value is not used, the address hold phase is always 1 Flash clock period duration.
@{*/
/**@}*/


#define FMC_FMC_BWTR3_ADDSET_SHIFT		0
#define FMC_FMC_BWTR3_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_bwtr3_addset ADDSET Address setup phase duration. These bits are written by software to define the duration of the address setup phase in KCK_FMC cycles (refer to Figure81 to Figure93), used in asynchronous accesses: ... Note: In synchronous accesses, this value is not used, the address setup phase is always 1 Flash clock period duration. In muxed mode, the minimum ADDSET value is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_bwtr4 FMCBWTR4 This register contains the control information of each memory bank. It is used for SRAMs, PSRAMs and NOR Flash memories. When the EXTMOD bit is set in the FMC_BCRx register, then this register is active for write access.
@{*/


#define FMC_FMC_BWTR4_ACCMOD_SHIFT		28
#define FMC_FMC_BWTR4_ACCMOD_MASK		0x03
/** @defgroup fmc_fmc_bwtr4_accmod ACCMOD Access mode. These bits specify the asynchronous access modes as shown in the next timing diagrams.These bits are taken into account only when the EXTMOD bit in the FMC_BCRx register is 1.
@{*/
/**@}*/


#define FMC_FMC_BWTR4_BUSTURN_SHIFT		16
#define FMC_FMC_BWTR4_BUSTURN_MASK		0x0f
/** @defgroup fmc_fmc_bwtr4_busturn BUSTURN Bus turnaround phase duration These bits are written by software to add a delay at the end of a write transaction to match the minimum time between consecutive transactions (tEHEL from ENx high to ENx low): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin. The programmed bus turnaround delay is inserted between a an asynchronous write transfer and any other asynchronous /synchronous read or write transfer to or from a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except for muxed mode and mode D. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank A synchronous write transfer ((in Burst or Single mode) and an asynchronous write or read transfer to or from static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write transfer (in Burst or Single mode) and a synchronous read from the same or a different bank. ...
@{*/
/**@}*/


#define FMC_FMC_BWTR4_DATAST_SHIFT		8
#define FMC_FMC_BWTR4_DATAST_MASK		0xff
/** @defgroup fmc_fmc_bwtr4_datast DATAST Data-phase duration. These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous SRAM, PSRAM and NOR Flash memory accesses:
@{*/
/**@}*/


#define FMC_FMC_BWTR4_ADDHLD_SHIFT		4
#define FMC_FMC_BWTR4_ADDHLD_MASK		0x0f
/** @defgroup fmc_fmc_bwtr4_addhld ADDHLD Address-hold phase duration. These bits are written by software to define the duration of the address hold phase (refer to Figure81 to Figure93), used in asynchronous multiplexed accesses: ... Note: In synchronous NOR Flash accesses, this value is not used, the address hold phase is always 1 Flash clock period duration.
@{*/
/**@}*/


#define FMC_FMC_BWTR4_ADDSET_SHIFT		0
#define FMC_FMC_BWTR4_ADDSET_MASK		0x0f
/** @defgroup fmc_fmc_bwtr4_addset ADDSET Address setup phase duration. These bits are written by software to define the duration of the address setup phase in KCK_FMC cycles (refer to Figure81 to Figure93), used in asynchronous accesses: ... Note: In synchronous accesses, this value is not used, the address setup phase is always 1 Flash clock period duration. In muxed mode, the minimum ADDSET value is 1.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_sdcr1 FMCSDCR1 This register contains the control parameters for each SDRAM memory bank
@{*/


#define FMC_FMC_SDCR1_RPIPE_SHIFT		13
#define FMC_FMC_SDCR1_RPIPE_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_rpipe RPIPE Read pipe These bits define the delay, in KCK_FMC clock cycles, for reading data after CAS latency. Note: The corresponding bits in the FMC_SDCR2 register is read only.
@{*/
/**@}*/

/** FMC_FMC_SDCR1_RBURST Burst read This bit enables burst read mode. The SDRAM controller anticipates the next read commands during the CAS latency and stores data in the Read FIFO. Note: The corresponding bit in the FMC_SDCR2 register is read only. **/
#define FMC_FMC_SDCR1_RBURST		(1 << 12)

#define FMC_FMC_SDCR1_SDCLK_SHIFT		10
#define FMC_FMC_SDCR1_SDCLK_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_sdclk SDCLK SDRAM clock configuration These bits define the SDRAM clock period for both SDRAM banks and allow disabling the clock before changing the frequency. In this case the SDRAM must be re-initialized. Note: The corresponding bits in the FMC_SDCR2 register is read only.
@{*/
/**@}*/

/** FMC_FMC_SDCR1_WP Write protection This bit enables write mode access to the SDRAM bank. **/
#define FMC_FMC_SDCR1_WP		(1 << 9)

#define FMC_FMC_SDCR1_CAS_SHIFT		7
#define FMC_FMC_SDCR1_CAS_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_cas CAS CAS Latency This bits sets the SDRAM CAS latency in number of memory clock cycles
@{*/
/**@}*/

/** FMC_FMC_SDCR1_NB Number of internal banks This bit sets the number of internal banks. **/
#define FMC_FMC_SDCR1_NB		(1 << 6)

#define FMC_FMC_SDCR1_MWID_SHIFT		4
#define FMC_FMC_SDCR1_MWID_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_mwid MWID Memory data bus width. These bits define the memory device width.
@{*/
/**@}*/


#define FMC_FMC_SDCR1_NR_SHIFT		2
#define FMC_FMC_SDCR1_NR_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_nr NR Number of row address bits These bits define the number of bits of a row address.
@{*/
/**@}*/


#define FMC_FMC_SDCR1_NC_SHIFT		0
#define FMC_FMC_SDCR1_NC_MASK		0x03
/** @defgroup fmc_fmc_sdcr1_nc NC Number of column address bits These bits define the number of bits of a column address.
@{*/
/**@}*/


/**@}*/

