grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
/** @defgroup fmc_fmc_sdcr2 FMCSDCR2 This register contains the control parameters for each SDRAM memory bank
@{*/


#define FMC_FMC_SDCR2_RPIPE_SHIFT		13
#define FMC_FMC_SDCR2_RPIPE_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_rpipe RPIPE Read pipe These bits define the delay, in KCK_FMC clock cycles, for reading data after CAS latency. Note: The corresponding bits in the FMC_SDCR2 register is read only.
@{*/
/**@}*/

/** FMC_FMC_SDCR2_RBURST Burst read This bit enables burst read mode. The SDRAM controller anticipates the next read commands during the CAS latency and stores data in the Read FIFO. Note: The corresponding bit in the FMC_SDCR2 register is read only. **/
#define FMC_FMC_SDCR2_RBURST		(1 << 12)

#define FMC_FMC_SDCR2_SDCLK_SHIFT		10
#define FMC_FMC_SDCR2_SDCLK_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_sdclk SDCLK SDRAM clock configuration These bits define the SDRAM clock period for both SDRAM banks and allow disabling the clock before changing the frequency. In this case the SDRAM must be re-initialized. Note: The corresponding bits in the FMC_SDCR2 register is read only.
@{*/
/**@}*/

/** FMC_FMC_SDCR2_WP Write protection This bit enables write mode access to the SDRAM bank. **/
#define FMC_FMC_SDCR2_WP		(1 << 9)

#define FMC_FMC_SDCR2_CAS_SHIFT		7
#define FMC_FMC_SDCR2_CAS_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_cas CAS CAS Latency This bits sets the SDRAM CAS latency in number of memory clock cycles
@{*/
/**@}*/

/** FMC_FMC_SDCR2_NB Number of internal banks This bit sets the number of internal banks. **/
#define FMC_FMC_SDCR2_NB		(1 << 6)

#define FMC_FMC_SDCR2_MWID_SHIFT		4
#define FMC_FMC_SDCR2_MWID_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_mwid MWID Memory data bus width. These bits define the memory device width.
@{*/
/**@}*/


#define FMC_FMC_SDCR2_NR_SHIFT		2
#define FMC_FMC_SDCR2_NR_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_nr NR Number of row address bits These bits define the number of bits of a row address.
@{*/
/**@}*/


#define FMC_FMC_SDCR2_NC_SHIFT		0
#define FMC_FMC_SDCR2_NC_MASK		0x03
/** @defgroup fmc_fmc_sdcr2_nc NC Number of column address bits These bits define the number of bits of a column address.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_sdtr1 FMCSDTR1 This register contains the timing parameters of each SDRAM bank
@{*/


#define FMC_FMC_SDTR1_TRCD_SHIFT		24
#define FMC_FMC_SDTR1_TRCD_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_trcd TRCD Row to column delay These bits define the delay between the Activate command and a Read/Write command in number of memory clock cycles. ....
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TRP_SHIFT		20
#define FMC_FMC_SDTR1_TRP_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_trp TRP Row precharge delay These bits define the delay between a Precharge command and another command in number of memory clock cycles. The TRP timing is only configured in the FMC_SDTR1 register. If two SDRAM devices are used, the TRP must be programmed with the timing of the slowest device. .... Note: The corresponding bits in the FMC_SDTR2 register are dont care.
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TWR_SHIFT		16
#define FMC_FMC_SDTR1_TWR_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_twr TWR Recovery delay These bits define the delay between a Write and a Precharge command in number of memory clock cycles. .... Note: TWR must be programmed to match the write recovery time (tWR) defined in the SDRAM datasheet, and to guarantee that: TWR &#8805; TRAS - TRCD and TWR &#8805;TRC - TRCD - TRP Example: TRAS= 4 cycles, TRCD= 2 cycles. So, TWR &gt;= 2 cycles. TWR must be programmed to 0x1. If two SDRAM devices are used, the FMC_SDTR1 and FMC_SDTR2 must be programmed with the same TWR timing corresponding to the slowest SDRAM device.
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TRC_SHIFT		12
#define FMC_FMC_SDTR1_TRC_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_trc TRC Row cycle delay These bits define the delay between the Refresh command and the Activate command, as well as the delay between two consecutive Refresh commands. It is expressed in number of memory clock cycles. The TRC timing is only configured in the FMC_SDTR1 register. If two SDRAM devices are used, the TRC must be programmed with the timings of the slowest device. .... Note: TRC must match the TRC and TRFC (Auto Refresh period) timings defined in the SDRAM device datasheet. Note: The corresponding bits in the FMC_SDTR2 register are dont care.
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TRAS_SHIFT		8
#define FMC_FMC_SDTR1_TRAS_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_tras TRAS Self refresh time These bits define the minimum Self-refresh period in number of memory clock cycles. ....
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TXSR_SHIFT		4
#define FMC_FMC_SDTR1_TXSR_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_txsr TXSR Exit Self-refresh delay These bits define the delay from releasing the Self-refresh command to issuing the Activate command in number of memory clock cycles. .... Note: If two SDRAM devices are used, the FMC_SDTR1 and FMC_SDTR2 must be programmed with the same TXSR timing corresponding to the slowest SDRAM device.
@{*/
/**@}*/


#define FMC_FMC_SDTR1_TMRD_SHIFT		0
#define FMC_FMC_SDTR1_TMRD_MASK		0x0f
/** @defgroup fmc_fmc_sdtr1_tmrd TMRD Load Mode Register to Active These bits define the delay between a Load Mode Register command and an Active or Refresh command in number of memory clock cycles. ....
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_sdtr2 FMCSDTR2 This register contains the timing parameters of each SDRAM bank
@{*/


#define FMC_FMC_SDTR2_TRCD_SHIFT		24
#define FMC_FMC_SDTR2_TRCD_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_trcd TRCD Row to column delay These bits define the delay between the Activate command and a Read/Write command in number of memory clock cycles. ....
@{*/
/**@}*/


#define FMC_FMC_SDTR2_TRP_SHIFT		20
#define FMC_FMC_SDTR2_TRP_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_trp TRP Row precharge delay These bits define the delay between a Precharge command and another command in number of memory clock cycles. The TRP timing is only configured in the FMC_SDTR1 register. If two SDRAM devices are used, the TRP must be programmed with the timing of the slowest device. .... Note: The corresponding bits in the FMC_SDTR2 register are dont care.
@{*/
/**@}*/


