grevaillot/svd_tools/headers/STM32H7B3x/fmc.h
#define FMC_FMC_SDTR2_TWR_SHIFT		16
#define FMC_FMC_SDTR2_TWR_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_twr TWR Recovery delay These bits define the delay between a Write and a Precharge command in number of memory clock cycles. .... Note: TWR must be programmed to match the write recovery time (tWR) defined in the SDRAM datasheet, and to guarantee that: TWR &#8805; TRAS - TRCD and TWR &#8805;TRC - TRCD - TRP Example: TRAS= 4 cycles, TRCD= 2 cycles. So, TWR &gt;= 2 cycles. TWR must be programmed to 0x1. If two SDRAM devices are used, the FMC_SDTR1 and FMC_SDTR2 must be programmed with the same TWR timing corresponding to the slowest SDRAM device.
@{*/
/**@}*/


#define FMC_FMC_SDTR2_TRC_SHIFT		12
#define FMC_FMC_SDTR2_TRC_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_trc TRC Row cycle delay These bits define the delay between the Refresh command and the Activate command, as well as the delay between two consecutive Refresh commands. It is expressed in number of memory clock cycles. The TRC timing is only configured in the FMC_SDTR1 register. If two SDRAM devices are used, the TRC must be programmed with the timings of the slowest device. .... Note: TRC must match the TRC and TRFC (Auto Refresh period) timings defined in the SDRAM device datasheet. Note: The corresponding bits in the FMC_SDTR2 register are dont care.
@{*/
/**@}*/


#define FMC_FMC_SDTR2_TRAS_SHIFT		8
#define FMC_FMC_SDTR2_TRAS_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_tras TRAS Self refresh time These bits define the minimum Self-refresh period in number of memory clock cycles. ....
@{*/
/**@}*/


#define FMC_FMC_SDTR2_TXSR_SHIFT		4
#define FMC_FMC_SDTR2_TXSR_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_txsr TXSR Exit Self-refresh delay These bits define the delay from releasing the Self-refresh command to issuing the Activate command in number of memory clock cycles. .... Note: If two SDRAM devices are used, the FMC_SDTR1 and FMC_SDTR2 must be programmed with the same TXSR timing corresponding to the slowest SDRAM device.
@{*/
/**@}*/


#define FMC_FMC_SDTR2_TMRD_SHIFT		0
#define FMC_FMC_SDTR2_TMRD_MASK		0x0f
/** @defgroup fmc_fmc_sdtr2_tmrd TMRD Load Mode Register to Active These bits define the delay between a Load Mode Register command and an Active or Refresh command in number of memory clock cycles. ....
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_sdcmr FMCSDCMR This register contains the command issued when the SDRAM device is accessed. This register is used to initialize the SDRAM device, and to activate the Self-refresh and the Power-down modes. As soon as the MODE field is written, the command will be issued only to one or to both SDRAM banks according to CTB1 and CTB2 command bits. This register is the same for both SDRAM banks.
@{*/


#define FMC_FMC_SDCMR_MRD_SHIFT		9
#define FMC_FMC_SDCMR_MRD_MASK		0x3fff
/** @defgroup fmc_fmc_sdcmr_mrd MRD Mode Register definition This 14-bit field defines the SDRAM Mode Register content. The Mode Register is programmed using the Load Mode Register command. The MRD[13:0] bits are also used to program the extended mode register for mobile SDRAM.
@{*/
/**@}*/


#define FMC_FMC_SDCMR_NRFS_SHIFT		5
#define FMC_FMC_SDCMR_NRFS_MASK		0x0f
/** @defgroup fmc_fmc_sdcmr_nrfs NRFS Number of Auto-refresh These bits define the number of consecutive Auto-refresh commands issued when MODE = 011. ....
@{*/
/**@}*/

/** FMC_FMC_SDCMR_CTB1 Command Target Bank 1 This bit indicates whether the command will be issued to SDRAM Bank 1 or not. **/
#define FMC_FMC_SDCMR_CTB1		(1 << 4)
/** FMC_FMC_SDCMR_CTB2 Command Target Bank 2 This bit indicates whether the command will be issued to SDRAM Bank 2 or not. **/
#define FMC_FMC_SDCMR_CTB2		(1 << 3)

#define FMC_FMC_SDCMR_MODE_SHIFT		0
#define FMC_FMC_SDCMR_MODE_MASK		0x07
/** @defgroup fmc_fmc_sdcmr_mode MODE Command mode These bits define the command issued to the SDRAM device. Note: When a command is issued, at least one Command Target Bank bit ( CTB1 or CTB2) must be set otherwise the command will be ignored. Note: If two SDRAM banks are used, the Auto-refresh and PALL command must be issued simultaneously to the two devices with CTB1 and CTB2 bits set otherwise the command will be ignored. Note: If only one SDRAM bank is used and a command is issued with its associated CTB bit set, the other CTB bit of the unused bank must be kept to 0.
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_fmc_sdrtr FMCSDRTR This register sets the refresh rate in number of SDCLK clock cycles between the refresh cycles by configuring the Refresh Timer Count value.Examplewhere 64 ms is the SDRAM refresh period.The refresh rate must be increased by 20 SDRAM clock cycles (as in the above example) to obtain a safe margin if an internal refresh request occurs when a read request has been accepted. It corresponds to a COUNT value of 0000111000000 (448). This 13-bit field is loaded into a timer which is decremented using the SDRAM clock. This timer generates a refresh pulse when zero is reached. The COUNT value must be set at least to 41 SDRAM clock cycles.As soon as the FMC_SDRTR register is programmed, the timer starts counting. If the value programmed in the register is 0, no refresh is carried out. This register must not be reprogrammed after the initialization procedure to avoid modifying the refresh rate.Each time a refresh pulse is generated, this 13-bit COUNT field is reloaded into the counter.If a memory access is in progress, the Auto-refresh request is delayed. However, if the memory access and Auto-refresh requests are generated simultaneously, the Auto-refresh takes precedence. If the memory access occurs during a refresh operation, the request is buffered to be processed when the refresh is complete.This register is common to SDRAM bank 1 and bank 2.
@{*/

/** FMC_FMC_SDRTR_REIE RES Interrupt Enable **/
#define FMC_FMC_SDRTR_REIE		(1 << 14)

#define FMC_FMC_SDRTR_COUNT_SHIFT		1
#define FMC_FMC_SDRTR_COUNT_MASK		0x1fff
/** @defgroup fmc_fmc_sdrtr_count COUNT Refresh Timer Count This 13-bit field defines the refresh rate of the SDRAM device. It is expressed in number of memory clock cycles. It must be set at least to 41 SDRAM clock cycles (0x29). Refresh rate = (COUNT + 1) x SDRAM frequency clock COUNT = (SDRAM refresh period / Number of rows) - 20
@{*/
/**@}*/

/** FMC_FMC_SDRTR_CRE Clear Refresh error flag This bit is used to clear the Refresh Error Flag (RE) in the Status Register. **/
#define FMC_FMC_SDRTR_CRE		(1 << 0)

/**@}*/

/** @defgroup fmc_fmc_sdsr FMCSDSR SDRAM Status register
@{*/


#define FMC_FMC_SDSR_MODES2_SHIFT		3
#define FMC_FMC_SDSR_MODES2_MASK		0x03
/** @defgroup fmc_fmc_sdsr_modes2 MODES2 Status Mode for Bank 2 These bits define the Status Mode of SDRAM Bank 2.
@{*/
/**@}*/


#define FMC_FMC_SDSR_MODES1_SHIFT		1
#define FMC_FMC_SDSR_MODES1_MASK		0x03
/** @defgroup fmc_fmc_sdsr_modes1 MODES1 Status Mode for Bank 1 These bits define the Status Mode of SDRAM Bank 1.
@{*/
/**@}*/

/** FMC_FMC_SDSR_RE Refresh error flag An interrupt is generated if REIE = 1 and RE = 1 **/
#define FMC_FMC_SDSR_RE		(1 << 0)

/**@}*/
